{
    "architectures": [
        "Gemma4ForConditionalGeneration"
    ],
    "audio_config": null,
    "audio_token_id": 258881,
    "boa_token_id": 256000,
    "boi_token_id": 255999,
    "dtype": "bfloat16",
    "eoa_token_id": 258883,
    "eoa_token_index": 258883,
    "eoi_token_id": 258882,
    "eos_token_id": [
        1,
        106
    ],
    "image_token_id": 258880,
    "initializer_range": 0.02,
    "model_type": "gemma4",
    "text_config": {
        "attention_bias": false,
        "attention_dropout": 0.0,
        "attention_k_eq_v": true,
        "bos_token_id": 2,
        "dtype": "bfloat16",
        "enable_moe_block": false,
        "eos_token_id": 1,
        "expert_intermediate_size": null,
        "final_logit_softcapping": 30.0,
        "global_head_dim": 512,
        "head_dim": 256,
        "hidden_activation": "gelu_pytorch_tanh",
        "hidden_size": 5376,
        "hidden_size_per_layer_input": 0,
        "initializer_range": 0.02,
        "intermediate_size": 21504,
        "layer_types": [
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "sliding_attention",
            "full_attention"
        ],
        "max_position_embeddings": 262144,
        "model_type": "gemma4_text",
        "num_attention_heads": 32,
        "num_experts": null,
        "num_global_key_value_heads": 4,
        "num_hidden_layers": 60,
        "num_key_value_heads": 16,
        "num_kv_shared_layers": 0,
        "pad_token_id": 0,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "full_attention": {
                "partial_rotary_factor": 0.25,
                "rope_theta": 1000000.0,
                "rope_type": "proportional"
            },
            "sliding_attention": {
                "rope_theta": 10000.0,
                "rope_type": "default"
            }
        },
        "sliding_window": 1024,
        "tie_word_embeddings": true,
        "top_k_experts": null,
        "use_bidirectional_attention": "vision",
        "use_cache": true,
        "use_double_wide_mlp": false,
        "vocab_size": 262144,
        "vocab_size_per_layer_input": 262144
    },
    "tie_word_embeddings": true,
    "transformers_version": "5.5.0.dev0",
    "video_token_id": 258884,
    "vision_config": {
        "attention_bias": false,
        "attention_dropout": 0.0,
        "default_output_length": 280,
        "dtype": "bfloat16",
        "global_head_dim": 72,
        "head_dim": 72,
        "hidden_activation": "gelu_pytorch_tanh",
        "hidden_size": 1152,
        "image_seq_length": 280,
        "initializer_range": 0.02,
        "intermediate_size": 4304,
        "max_position_embeddings": 131072,
        "model_type": "gemma4_vision",
        "num_attention_heads": 16,
        "num_hidden_layers": 27,
        "num_key_value_heads": 16,
        "patch_size": 16,
        "pooling_kernel_size": 3,
        "position_embedding_size": 10240,
        "rms_norm_eps": 1e-06,
        "rope_parameters": {
            "rope_theta": 100.0,
            "rope_type": "default"
        },
        "standardize": true,
        "use_clipped_linears": false,
        "video_seq_length": 70
    },
    "vision_soft_tokens_per_image": 280,
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "weights": {
                    "dynamic": false,
                    "num_bits": 4,
                    "type": "float",
                    "group_size": 16
                },
                "targets": [
                    "Linear"
                ]
            }
        },
        "ignore": [
            "lm_head",
            "model.embed_vision*",
            "model.language_model.layers.0.self_attn*",
            "model.language_model.layers.1.self_attn*",
            "model.language_model.layers.10.self_attn*",
            "model.language_model.layers.11.self_attn*",
            "model.language_model.layers.12.self_attn*",
            "model.language_model.layers.13.self_attn*",
            "model.language_model.layers.14.self_attn*",
            "model.language_model.layers.15.self_attn*",
            "model.language_model.layers.16.self_attn*",
            "model.language_model.layers.17.self_attn*",
            "model.language_model.layers.18.self_attn*",
            "model.language_model.layers.19.self_attn*",
            "model.language_model.layers.2.self_attn*",
            "model.language_model.layers.20.self_attn*",
            "model.language_model.layers.21.self_attn*",
            "model.language_model.layers.22.self_attn*",
            "model.language_model.layers.23.self_attn*",
            "model.language_model.layers.24.self_attn*",
            "model.language_model.layers.25.self_attn*",
            "model.language_model.layers.26.self_attn*",
            "model.language_model.layers.27.self_attn*",
            "model.language_model.layers.28.self_attn*",
            "model.language_model.layers.29.self_attn*",
            "model.language_model.layers.3.self_attn*",
            "model.language_model.layers.30.self_attn*",
            "model.language_model.layers.31.self_attn*",
            "model.language_model.layers.32.self_attn*",
            "model.language_model.layers.33.self_attn*",
            "model.language_model.layers.34.self_attn*",
            "model.language_model.layers.35.self_attn*",
            "model.language_model.layers.36.self_attn*",
            "model.language_model.layers.37.self_attn*",
            "model.language_model.layers.38.self_attn*",
            "model.language_model.layers.39.self_attn*",
            "model.language_model.layers.4.self_attn*",
            "model.language_model.layers.40.self_attn*",
            "model.language_model.layers.41.self_attn*",
            "model.language_model.layers.42.self_attn*",
            "model.language_model.layers.43.self_attn*",
            "model.language_model.layers.44.self_attn*",
            "model.language_model.layers.45.self_attn*",
            "model.language_model.layers.46.self_attn*",
            "model.language_model.layers.47.self_attn*",
            "model.language_model.layers.48.self_attn*",
            "model.language_model.layers.49.self_attn*",
            "model.language_model.layers.5.self_attn*",
            "model.language_model.layers.50.self_attn*",
            "model.language_model.layers.51.self_attn*",
            "model.language_model.layers.52.self_attn*",
            "model.language_model.layers.53.self_attn*",
            "model.language_model.layers.54.self_attn*",
            "model.language_model.layers.55.self_attn*",
            "model.language_model.layers.56.self_attn*",
            "model.language_model.layers.57.self_attn*",
            "model.language_model.layers.58.self_attn*",
            "model.language_model.layers.59.self_attn*",
            "model.language_model.layers.6.self_attn*",
            "model.language_model.layers.7.self_attn*",
            "model.language_model.layers.8.self_attn*",
            "model.language_model.layers.9.self_attn*",
            "model.vision_tower*"
        ],
        "quant_algo": "NVFP4",
        "kv_cache_scheme": {
            "dynamic": false,
            "num_bits": 8,
            "type": "float"
        },
        "producer": {
            "name": "modelopt",
            "version": "0.37.0"
        },
        "quant_method": "modelopt"
    }
}