{
  "architectures": [
    "Gemma4ForConditionalGeneration"
  ],
  "audio_config": null,
  "audio_token_id": 258881,
  "boa_token_id": 256000,
  "boi_token_id": 255999,
  "torch_dtype": "bfloat16",
  "eoa_token_id": 258883,
  "eoa_token_index": 258883,
  "eoi_token_id": 258882,
  "eos_token_id": 106,
  "image_token_id": 258880,
  "initializer_range": 0.02,
  "model_type": "gemma4",
  "pad_token_id": 0,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": [
      "embed_tokens",
      "embedding",
      "lm_head",
      "multi_modal_projector",
      "merger",
      "modality_projection",
      "router",
      "visual",
      "vision_tower",
      "audio_tower",
      "embed_vision",
      "embed_audio",
      "embedding_projection",
      "per_layer_input_gate",
      "per_layer_projection",
      "per_layer_model_projection",
      "model.language_model.layers.7.self_attn",
      "model.language_model.layers.13.mlp",
      "model.language_model.layers.14.self_attn",
      "model.language_model.layers.8.mlp",
      "model.language_model.layers.14.mlp",
      "model.language_model.layers.7.mlp",
      "model.language_model.layers.12.self_attn",
      "model.language_model.layers.0.self_attn",
      "model.language_model.layers.22.mlp",
      "model.language_model.layers.2.self_attn",
      "model.language_model.layers.10.mlp",
      "model.language_model.layers.19.mlp",
      "model.language_model.layers.16.mlp",
      "model.language_model.layers.3.mlp",
      "model.language_model.layers.1.mlp"
    ],
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": true,
    "bos_token_id": 2,
    "torch_dtype": "bfloat16",
    "enable_moe_block": false,
    "eos_token_id": 1,
    "expert_intermediate_size": null,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 512,
    "head_dim": 256,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 5376,
    "hidden_size_per_layer_input": 0,
    "initializer_range": 0.02,
    "intermediate_size": 21504,
    "layer_types": [
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 262144,
    "model_type": "gemma4_text",
    "moe_intermediate_size": null,
    "num_attention_heads": 32,
    "num_experts": null,
    "num_global_key_value_heads": 4,
    "num_hidden_layers": 60,
    "num_key_value_heads": 16,
    "num_kv_shared_layers": 0,
    "pad_token_id": 0,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.25,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 1024,
    "tie_word_embeddings": true,
    "top_k_experts": null,
    "use_bidirectional_attention": "vision",
    "use_cache": true,
    "use_double_wide_mlp": false,
    "vocab_size": 262144,
    "vocab_size_per_layer_input": 262144
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0.dev0",
  "unsloth_fixed": true,
  "video_token_id": 258884,
  "vision_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "chunk_size_feed_forward": 0,
    "default_output_length": 280,
    "torch_dtype": "bfloat16",
    "global_head_dim": 72,
    "head_dim": 72,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 1152,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 4304,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "max_position_embeddings": 131072,
    "model_type": "gemma4_vision",
    "num_attention_heads": 16,
    "num_hidden_layers": 27,
    "num_key_value_heads": 16,
    "output_attentions": false,
    "output_hidden_states": false,
    "patch_size": 16,
    "pooling_kernel_size": 3,
    "position_embedding_size": 10240,
    "problem_type": null,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "rope_theta": 100.0,
      "rope_type": "default"
    },
    "standardize": true,
    "use_clipped_linears": false
  },
  "vision_soft_tokens_per_image": 280
}
